inspinia/app/Models/Contract.php

select * from `invoices` where `invoices`.`contract_id` = '1' and `invoices`.`contract_id` is not null and `status` = 'C' order by `year` desc, `month` desc limit 1
---
    public function getLastInvoiceCanceledAttribute(){
        $last_invoice_canceled = $this->invoices()->where('status', 'C')
                                                    ->orderBy('year', 'DESC')
                                                    ->orderBy('month', 'DESC')->first();