inspinia/app/Http/Controllers/CitizenController.php

select * from `company` limit 1
select * from `citizens`
---
    public function index($view)
    {

        if($view=='contact'){
            $citizens = Citizen::paginate(5);
            $company = Company::first();
            return view('citizens.index2')->with('citizens', $citizens)
                                    ->with('company', $company);
        }else if($view=='list'){
            $citizens = Citizen::orderBy('name')->get();
            $company = Company::first();
            return view('citizens.index')->with('citizens', $citizens)
                                    ->with('company', $company);