inspinia/app/Http/Controllers/ContractController.php

select * from `company` limit 1
---
    public function index()
    {
        $company = Company::first();
        $contracts = Contract::all();
        return view('contracts.index')->with('contracts', $contracts)
                                    ->with('company', $company);

select * from `contracts`
---
    public function citizen_contracts($citizen_id)
    {
        $company = Company::first();
        $citizen = Citizen::find(Crypt::decrypt($citizen_id));
        $contracts = $citizen->contracts()->get();