inspinia/app/Http/Controllers/HomeController.php

    public function index()
    {
        $current_year = Carbon::now()->year;
        $current_month = (strlen(Carbon::now()->month)==1)?'0'.Carbon::now()->month:Carbon::now()->month;
        $citizens = Citizen::all();
        $contracts = Contract::all();
        $payments = Payment::whereYear('date', '=', $current_year)
                            ->whereMonth('date', '=', $current_month);
        $invoices = Invoice::where('year', '=', $current_year)
                            ->where('month', '=', $current_month);
        return view('home')->with('citizens', $citizens)
                            ->with('contracts', $contracts)
                            ->with('current_year', $current_year)
                            ->with('current_month', $current_month)
                            ->with('payments', $payments)
                            ->with('invoices', $invoices);
---
select * from `citizens`
select * from `contracts`