inspinia/app/Http/Controllers/HomeController.php

    public function index()
    {

        $current_year = Carbon::now()->year;
        $current_month = Carbon::now()->month;

        //Pagos
        $payments = Movement::where('movement_type', 'D')
                            ->where('type', 'P')
                            ->whereYear('date', '=', $current_year)
                            ->whereMonth('date', '=', $current_month)->get();
        //Descuentos
        $discounts = Movement::where('movement_type', 'D')
                            ->where('type', 'D')
                            ->whereYear('date', '=', $current_year)
                            ->whereMonth('date', '=', $current_month)->get();
        //Recibos del Mes
        $invoices_month = Invoice::whereYear('date', '=', $current_year)
                            ->whereMonth('date', '=', $current_month)->get();

        //Recibos del Año
        $invoices_year = Invoice::whereYear('date', '=', $current_year)->get();

        //Debitos del Año
        $debits_year = Movement::whereYear('date', '=', $current_year)
                                ->where('movement_type', 'D')->get();

        //Creditos del Año
        $credits_year = Movement::whereYear('date', '=', $current_year)
                                ->where('movement_type', 'C')->get();
---
select * from `movements` where `movement_type` = 'D' and `type` = 'P' and year(`date`) = '2017' and month(`date`) = '9'
select * from `invoices` where year(`date`) = '2017' and month(`date`) = '9'
select * from `movements` where year(`date`) = '2017' and `movement_type` = 'D'

    public function invoices_data_set($current_year){
        $output="";
        for ($i= 1; $i <= 12; $i++) {
            $total_month = Invoice::whereYear('date', '=', $current_year)
                                    ->whereMonth('date', '=', $i)->sum('total');
---
select sum(`total`) as aggregate from `invoices` where year(`date`) = '2017' and month(`date`) = '1'

    public function incomes_data_set($current_year){
        $output="";
        for ($i= 1; $i <= 12; $i++) {
            //Pagos (no incluye descuentos)
            $total_month = Movement::where('movement_type', 'D')
                            ->where('type', 'P')
                            ->whereYear('date', '=', $current_year)
                            ->whereMonth('date', '=', $i)->sum('amount');
---
select sum(`amount`) as aggregate from `movements` where `movement_type` = 'D' and `type` = 'P' and year(`date`) = '2017' and month(`date`) = '1'

    public function ticks_neighborhood(){
        $output="";
        $i=1;
        $contracts = Contract::groupBy('neighborhood')->get();
---
select * from `contracts` group by `neighborhood`

    public function invoices_by_neighborhood($current_year){
        $output="";
        $i=1;
        $contracts = Contract::groupBy('neighborhood')->get();
        $max_i =  $contracts->count();
        foreach ($contracts as $contract) {
            $invoices = Invoice::whereYear('date', '=', $current_year)
                                ->whereHas('Contract',
                                function($q) use ($contract){
                                    $q->where('neighborhood', $contract->neighborhood);
                                })->get();
---
select * from `invoices` where year(`date`) = '2017' and exists (select * from `contracts` where `invoices`.`contract_id` = `contracts`.`id` and `neighborhood` = 'BUENA VISTA')
select * from `contracts` group by `neighborhood`

    public function incomes_by_neighborhood($current_year){
        $output="";
        $i=1;
        $contracts = Contract::groupBy('neighborhood')->get();
        $max_i =  $contracts->count();
        foreach ($contracts as $contract) {
            //Pagos (no incluye descuentos)
            $movements = Movement::whereYear('date', '=', $current_year)
                                ->where('movement_type', 'D')
                                ->where('type', 'P')
                                ->whereHas('Contract',
                                function($q) use ($contract){
                                    $q->where('neighborhood', $contract->neighborhood);
                                })->get();
---
select * from `movements` where year(`date`) = '2017' and `movement_type` = 'D' and `type` = 'P' and exists (select * from `contracts` where `movements`.`contract_id` = `contracts`.`id` and `neighborhood` = 'BUENA VISTA')
select * from `contracts` group by `neighborhood`