inspinia/app/Http/Controllers/ImgController.php

select * from `users` where `users`.`id` = '1' limit 1
---
    public function showUserAvatar($id)
    {
        $user = User::findOrFail($id);

select * from `citizens` where `citizens`.`id` = '6' limit 1
---
    public function showCitizenAvatar($id)
    {
        $citizen = Citizen::findOrFail($id);