inspinia/app/Http/Controllers/InvoiceController.php

select * from `company` limit 1
select count(*) as aggregate from `invoices` where date(`date`) >= '2017-09-01' and date(`date`) <= '2017-09-30' and `total` > '0' order by `date` asc
select sum(`total`) as aggregate from `invoices` where date(`date`) >= '2017-09-01' and date(`date`) <= '2017-09-30' and `total` > '0' order by `date` asc
select * from `invoices` where date(`date`) >= '2017-09-01' and date(`date`) <= '2017-09-30' and `total` > '0' order by `date` asc limit 10 offset 0
select count(*) as aggregate from `invoices` where date(`date`) >= '2017-09-01' and date(`date`) <= '2017-09-30' and `total` > '0'
---
    public function index()
    {

        $company = Company::first();

        $from = (new Carbon(Session::get('from')))->format('d/m/Y');
        $to = (new Carbon(Session::get('to')))->format('d/m/Y');

        $invoices = Invoice::whereDate('date', '>=', Session::get('from'))
                            ->whereDate('date', '<=' , Session::get('to'))
                            ->where('total', '>', 0)
                            ->orderBy('date');

        $invoices_count = $invoices->count();
        $invoices_total = $invoices->sum('total');

        $invoices = $invoices->paginate(10);

select * from `routines` order by `year` desc, `month` desc limit 10
---
    public function print_invoices()
    {
        $routines = Routine::orderBy('year', 'DES')
                            ->orderBy('month', 'DESC')->take(10)->get();