inspinia/app/Http/Controllers/PDFController.php

    public function invoices_pdf(InvoiceRequestPrint $request)
    {
        $company = Company::first();
        $invoices = Invoice::where('id', '>=' , $request->input('invoice_from'))
                            ->where('id', '<=' , $request->input('invoice_to'))->get();
---
select * from `company` limit 1
select * from `invoices` where `id` >= '4000' and `id` <= '4049'